DOC/readme.tex
% Created 2018-01-14 Dim 21:58
\documentclass[article,letterpaper,12pt]{article}
	       \usepackage{graphicx}
	       \usepackage{epstopdf}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[margin=1in]{geometry}
\date{\today}
\title{Brewing temperature controler}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.3.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section*{Temperature sensor DS18B20}
\label{sec-1}
The DS18B20 temperature sensor is used in a sealed version. The fact that the sensor is placed inside a sealed container increases the temperature response time.
The step response of the temperature sensor has been measured and the corresponding first order system has been identified :
\begin{equation}
s_s(t) = 1 - e^{-\frac{t}{11.3568}}.
\end{equation}
This means that more than 33s is necesssary for the sensor to recover 99\% of the final temperature. This sensor is only suited to measure very slow processes, such has a room temperature for example.
It is necessary to acount for this slow transfer function from real to measured temperature in order to improve the contoler abilities.\\
The corresponding indicail response is :
\begin{equation}
s_i(t) = H(t) e^{-\frac{t}{11.3568}},
\end{equation}
where H(t) is the Heaviside function. The measured temperature $T_m$ is obtained from the real
temperature $T$ via the following convultion :
\begin{eqnarray}
T_m(t) &= &\int_{-\infty}^{+\infty} T(\tau) s_i(t-\tau) d \tau\\
\end{eqnarray}
% Emacs 25.3.1 (Org mode 8.2.10)
\end{document}